app/helpers/session_helper.rb

  def current_user
    User.find_by(id: session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]